v3-aws-native-arch/load-test-results/metrics_20260113_222851.txt

Summary:
  Total:	2.7295 secs
  Slowest:	0.8992 secs
  Fastest:	0.1697 secs
  Average:	0.2465 secs
  Requests/sec:	18.3186
  

Response time histogram:
  0.170 [1]	|■
  0.243 [43]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.316 [0]	|
  0.389 [0]	|
  0.461 [0]	|
  0.534 [0]	|
  0.607 [1]	|■
  0.680 [0]	|
  0.753 [1]	|■
  0.826 [2]	|■■
  0.899 [2]	|■■


Latency distribution:
  10% in 0.1718 secs
  25% in 0.1723 secs
  50% in 0.1732 secs
  75% in 0.1789 secs
  90% in 0.7511 secs
  95% in 0.8962 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0583 secs, 0.1697 secs, 0.8992 secs
  DNS-lookup:	0.0228 secs, 0.0000 secs, 0.2280 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.1875 secs, 0.1693 secs, 0.5955 secs
  resp read:	0.0007 secs, 0.0003 secs, 0.0079 secs

Status code distribution:
  [200]	50 responses